tutorials/verificationAndValidation/DHIT/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (12.7 0 0);

boundaryField
{
    inlet
    {
        type    turbulentDigitalFilterInlet;
        n       ( 39 39 );
        L
        (
            2.4e-2 1.27e-2 1.27e-2
            1.27e-2 2.4e-2 1.27e-2
            1.27e-2 1.27e-2 2.4e-2
        );
        R       uniform ( 4.9284e-2 0 0 4.9284e-2 0 4.9284e-2 );
        UMean   uniform ( 12.7 0 0 );
        Ubulk   12.7;
        value   uniform (0 0 0);
    }

    outlet
    {
        type    advective;
        phi     phi;
    }

    "(left|right|top|bottom)"
    {
        type    cyclic;
    }
}


// ************************************************************************* //
