tutorials/verificationAndValidation/DHIT/system/probesAveraging
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probesAveraging
{
    type            probes;
    libs            (sampling);
    timeStart       $/timeStart;
    writeControl    writeTime;
    fixedLocations  true;
    interpolationScheme cellPoint;

    fields ( p U );

    probeLocations
    (
        // Averaging - development distance
        (0.0508 7.62e-2 0)
        (0.1016 7.62e-2 0)
        (0.1524 7.62e-2 0)
        (0.2032 7.62e-2 0)
        (0.2540 7.62e-2 0)
        (0.3048 7.62e-2 0)
        (0.3556 7.62e-2 0)
        (0.4064 7.62e-2 0)
        (0.4572 7.62e-2 0)
        (0.5080 7.62e-2 0)

        (7.62e-1 7.62e-2 0)
        (1.016 7.62e-2 0)
        (1.270 7.62e-2 0)
        (1.4224 7.62e-2 0) // 28M
        (1.524 7.62e-2 0)
        (1.778 7.62e-2 0)
        (2.032 7.62e-2 0)
        (2.286 7.62e-2 0)
        (2.540 7.62e-2 0)
        (2.794 7.62e-2 0)
        (3.048 7.62e-2 0)
        (3.302 7.62e-2 0)
        (3.556 7.62e-2 0)
        (3.810 7.62e-2 0)
        (4.064 7.62e-2 0)
        (4.318 7.62e-2 0)
        (4.572 7.62e-2 0)
        (5.08 7.62e-2 0)
        (5.588 7.62e-2 0)
        (5.6896 7.62e-2 0) // 112M
        (6.5532 7.62e-2 0)

        // 28M
        (1.4224 3.81e-2 0)
        (1.4224 3.81e-2 3.81e-2)
        (1.4224 3.81e-2 -3.81e-2)
        (1.4224 1.143e-1 0)

        // 56M - probes across y-direction
        (2.8448 7.62e-2 -0.07424615)
        (2.8448 7.62e-2 -0.07033846)
        (2.8448 7.62e-2 -0.06643077)
        (2.8448 7.62e-2 -0.06252308)
        (2.8448 7.62e-2 -0.05861538)
        (2.8448 7.62e-2 -0.05470769)
        (2.8448 7.62e-2 -0.0508)
        (2.8448 7.62e-2 -0.04689231)
        (2.8448 7.62e-2 -0.04298462)
        (2.8448 7.62e-2 -0.03907692)
        (2.8448 7.62e-2 -0.03516923)
        (2.8448 7.62e-2 -0.03126154)
        (2.8448 7.62e-2 -0.02735385)
        (2.8448 7.62e-2 -0.02344615)
        (2.8448 7.62e-2 -0.01953846)
        (2.8448 7.62e-2 -0.01563077)
        (2.8448 7.62e-2 -0.01172308)
        (2.8448 7.62e-2 -0.00781538)
        (2.8448 7.62e-2 -0.00390769)
        (2.8448 7.62e-2 0)
        (2.8448 7.62e-2 0.00390769)
        (2.8448 7.62e-2 0.00781538)
        (2.8448 7.62e-2 0.01172308)
        (2.8448 7.62e-2 0.01563077)
        (2.8448 7.62e-2 0.01953846)
        (2.8448 7.62e-2 0.02344615)
        (2.8448 7.62e-2 0.02735385)
        (2.8448 7.62e-2 0.03126154)
        (2.8448 7.62e-2 0.03516923)
        (2.8448 7.62e-2 0.03907692)
        (2.8448 7.62e-2 0.04298462)
        (2.8448 7.62e-2 0.04689231)
        (2.8448 7.62e-2 0.0508)
        (2.8448 7.62e-2 0.05470769)
        (2.8448 7.62e-2 0.05861538)
        (2.8448 7.62e-2 0.06252308)
        (2.8448 7.62e-2 0.06643077)
        (2.8448 7.62e-2 0.07033846)
        (2.8448 7.62e-2 0.07424615)

        // 84M
        (4.2672 3.81e-2 0)
        (4.2672 7.62e-2 0)
        (4.2672 7.62e-2 3.81e-2)
        (4.2672 7.62e-2 -3.81e-2)
        (4.2672 1.143e-1 0)

        // 112M
        (5.6896 3.81e-2 0)
        (5.6896 7.62e-2 3.81e-2)
        (5.6896 7.62e-2 -3.81e-2)
        (5.6896 1.143e-1 0)

        // 129M - probes across y-direction
        (6.5532 7.62e-2 -0.07424615)
        (6.5532 7.62e-2 -0.07033846)
        (6.5532 7.62e-2 -0.06643077)
        (6.5532 7.62e-2 -0.06252308)
        (6.5532 7.62e-2 -0.05861538)
        (6.5532 7.62e-2 -0.05470769)
        (6.5532 7.62e-2 -0.0508)
        (6.5532 7.62e-2 -0.04689231)
        (6.5532 7.62e-2 -0.04298462)
        (6.5532 7.62e-2 -0.03907692)
        (6.5532 7.62e-2 -0.03516923)
        (6.5532 7.62e-2 -0.03126154)
        (6.5532 7.62e-2 -0.02735385)
        (6.5532 7.62e-2 -0.02344615)
        (6.5532 7.62e-2 -0.01953846)
        (6.5532 7.62e-2 -0.01563077)
        (6.5532 7.62e-2 -0.01172308)
        (6.5532 7.62e-2 -0.00781538)
        (6.5532 7.62e-2 -0.00390769)
        (6.5532 7.62e-2 0)
        (6.5532 7.62e-2 0.00390769)
        (6.5532 7.62e-2 0.00781538)
        (6.5532 7.62e-2 0.01172308)
        (6.5532 7.62e-2 0.01563077)
        (6.5532 7.62e-2 0.01953846)
        (6.5532 7.62e-2 0.02344615)
        (6.5532 7.62e-2 0.02735385)
        (6.5532 7.62e-2 0.03126154)
        (6.5532 7.62e-2 0.03516923)
        (6.5532 7.62e-2 0.03907692)
        (6.5532 7.62e-2 0.04298462)
        (6.5532 7.62e-2 0.04689231)
        (6.5532 7.62e-2 0.0508)
        (6.5532 7.62e-2 0.05470769)
        (6.5532 7.62e-2 0.05861538)
        (6.5532 7.62e-2 0.06252308)
        (6.5532 7.62e-2 0.06643077)
        (6.5532 7.62e-2 0.07033846)
        (6.5532 7.62e-2 0.07424615)
    );
}


// ************************************************************************* //
